/* 《漢語方音字彙》音韻地位描述
 *
 * - 北京大學中國語言文學系語言學教研室 (編). 1962. 漢語方音字彙. 北京: 文字改革出版社.
 * - 北京大學中國語言文學系語言學教研室 (編). 1989. 漢語方音字彙. 第二版. 北京: 文字改革出版社.
 * - 北京大學中國語言文學系語言學教研室 (編). 王福堂 (修訂). 2003. 漢語方音字彙. 第二版重排本. 北京: 語文出版社.
 *
 * @author unt
 */

if (!音韻地位) return [
  ['重紐第二類左上角加上黑點\n「重紐第二類」即 A 類', true],
];

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);
const 廣韻韻to廣韻韻目 = Object.fromEntries([
  '東董送屋',
  '冬腫宋沃',
  '鍾腫用燭',
  '江講絳覺',
  '支紙寘',
  '脂旨至',
  '之止志',
  '微尾未',
  '魚語御',
  '虞麌遇',
  '模姥暮',
  '齊薺霽',
  '　　祭',
  '　　泰',
  '佳蟹卦',
  '皆駭怪',
  '　　夬',
  '灰賄隊',
  '咍海代',
  '　　廢',
  '眞軫震質',
  '諄準稕術',
  '臻隱震櫛',
  '文吻問物',
  '欣隱焮迄',
  '元阮願月',
  '魂混慁沒',
  '痕很恨沒',
  '寒旱翰曷',
  '桓緩換末',
  '刪潸諫鎋',
  '山產襇黠',
  '先銑霰屑',
  '仙獮線薛',
  '蕭篠嘯',
  '宵小笑',
  '肴巧效',
  '豪晧号',
  '歌哿箇',
  '戈果過',
  '麻馬禡',
  '陽養漾藥',
  '唐蕩宕鐸',
  '庚梗映陌',
  '耕耿諍麥',
  '清靜勁昔',
  '青迥徑錫',
  '蒸拯證職',
  '登等嶝德',
  '尤有宥',
  '侯厚候',
  '幽黝幼',
  '侵寑沁緝',
  '覃感勘合',
  '談敢闞盍',
  '鹽琰豔葉',
  '添忝㮇怗',
  '咸豏陷洽',
  '銜檻鑑狎',
  '嚴儼釅業',
  '凡范梵乏',
].map(廣韻韻目s => [...廣韻韻目s]
  .map((廣韻韻目, i) => 廣韻韻目 === '　' ? null : ['平上去入'[i], 廣韻韻目])
  .filter(e => e)
).map(廣韻韻目s => [
  廣韻韻目s[0][1],
  Object.fromEntries(廣韻韻目s),
]));

let { 攝, 呼, 等, 聲, 韻, 母 } = 音韻地位;
let 重紐第二類標記 = 選項.重紐第二類左上角加上黑點 !== false && is`A類` ? '˙' : '';

呼 = when([
  ['通遇攝', '合'],
  ['江流攝', '開'],
  ['幫組', [
    // 脣音咍韻不考慮
    ['C類 或 一等 非 唐韻', '開'],
    ['', '合'],
  ]],
  ['', 呼 || 'aaa'],
]);

韻 = when([
  ['祭韻 非 去聲', '齊'],
  ['廢韻 非 去聲', [
    ['開口', '咍'],
    ['', '灰'],
  ]],
  ['真韻', [
    ['B類 或 莊組 或 非 合口', '眞'],
    ['', '諄'],
  ]],
  ['殷韻', '欣'],
  ['寒韻 非 (一等 開口)', '桓'],
  ['歌韻 非 (一等 開口)', '戈'],
  ['', 韻],
]);
韻 = 廣韻韻to廣韻韻目[韻][聲].slice(-1);

母 = when([
  ['幫母 C類', '非'],
  ['滂母 C類', '敷'],
  ['並母 C類', '奉'],
  ['明母 C類', '微'],
  ['孃母', '泥'],
  ['俟母', '崇'], // 據《方言調查字表》第 18 頁併入崇母
  ['常母', '禅'],
  ['', 母],
]);

return [重紐第二類標記, 攝, 呼, 等, 聲, 韻, 母].join('');
